using Infrastructure.Utils.Text.Analyzers;
using Xunit;
using System.Collections.Generic;
using System.Linq;

namespace UnitTestProject;



public class FrequencyAnalyzerTests
{

    //[Fact]
    //public void MakeFile()
    //{
    //    string json1 = File.ReadAllText(@"C:\temp\1.json");
    //    string json2 = File.ReadAllText(@"C:\temp\2.json");
    //    var first = JsonSerializer.Deserialize<Template>(json1, new JsonSerializerOptions
    //    {
    //        PropertyNameCaseInsensitive = true
    //    });
    //    var second = JsonSerializer.Deserialize<Template>(json2, new JsonSerializerOptions
    //    {
    //        PropertyNameCaseInsensitive = true
    //    });
    //    var sentences = first.Items.Select(x => x.Snippet.Title)
    //        .Union(second.Items.Select(x => x.Snippet.Title))
    //        .ToArray()
    //        .Select(x => HttpUtility.HtmlDecode(x))
    //        .ToArray();

    //    File.WriteAllText(@"C:\temp\sentens.txt", string.Join('\n', sentences));
    //}

    //public class Template
    //{
    //    public TemplateItem[] Items { get; set; }

    //    public class TemplateItem
    //    {
    //        public class SnippetModel
    //        {
    //            public string Title { get; set; }
    //        }
    //        public SnippetModel Snippet { get; set; }
    //    }
    //}


    [Fact]
    public void MemoryStore()
    {
        var manager = new FrequencyAnalyzer()
        {
            MinSegmentWords = 3
        };
        manager.IgnoredSegmentsEndsWith.Add("המסר היומי");
        manager.IgnoredSegmentsEndsWith.Add("המסר");
        foreach (var sentence in GetSentences())
        {
            manager.Add(sentence);
        }
        manager.Add("roei is the king");

        var results = manager.Get();
        Assert.Equal("הרב יורם אברגל", results.OrderByDescending(x => x.Value).First().Key);
    }


    private static string[] GetSentences()
    {
        return
        [
            "הרב יורם אברג'ל - המסר היומי - סוד הפרנסה ברווח- ט\"ז אדר ב' תשע\"ד",
            "הרב יורם אברג'ל - סיפורו של מוטי דנינו - לך תתגרש -כ\"ה אב תשע\"ו",
            "הרב יורם אברג'ל - ראיון לערוץ 2",
            "הרב יורם אברג'ל זיע\"א - ההגנה - י' טבת תש\"פ",
            "הרב יורם אברג'ל - המסר היומי - מעלת התהילים - ט\"ז טבת תשע\"ד",
            "הרב יורם אברג'ל-החלום-ז' אייר תשע\"ו",
            "הרב יורם אברג'ל - המסר היומי – אין לאשה אלא בעלה וילדיה –י''ב כסלו תש''פ",
            "הרב יורם אברג'ל- הבטחת הרב-כ\"ט תשרי תשע\"ו",
            "הרב יורם אברג'ל - המסר היומי -פגישה עם חכם עובדיה זצוק\"ל- ב' חשוון תשע\"ה",
            "הרב יורם אברג'ל - המסר היומי – דרך הצדיק הבבא סאלי–ג' שבט תש''פ",
            "הרב יורם אברג'ל-המסר היומי- שנכנס אדר מרבין בשמחה - ל' שבט תש\"פ",
            "הרב יורם אברג'ל - המסר היומי – לכל קלקול יש תקנה –י\"ט טבת תש\"פ",
            "הרב יורם אברג'ל - המסר היומי - אני כאן בשבילכם- י\"ב תשרי תשע\"ו",
            "הרב יורם אברג'ל  - המסר היומי -  סבלנות והכל יסתדר -  כ''ג תשרי תש''פ",
            "הרב יורם אברג'ל - המסר היומי – אל תהיה כמו זבוב –כ''ח חשוון תש''פ",
            "הרב יורם אברג'ל - המסר היומי – הרב מגן עליך –ה' טבת תש\"פ",
            "הרב יורם אברג'ל - המסר היומי – בית של שכינה–י''ז שבט תש''פ",
            "הרב יורם אברג'ל - המסר היומי -מה יעשה המשיח כשיבוא? - ו' ניסן תשע\"ד",
            "הרב יורם אברג'ל - המסר היומי – תגמל מההרגלים הלא טובים –י''ז טבת תש''פ",
            "הרב יורם אברג'ל - המסר היומי - אל תזוז מהתניא - י\"א שבט תש\"פ",
            "הרב יורם אברג'ל-סיפורו של אדון דדון-ד' ניסן תשע\"ז",
            "הרב יורם אברג'ל - המסר היומי – הערב הזה זה לא החג שלנו –ג' טבת תש''פ",
            "הרב יורם אברג'ל - המסר היומי – גדולת ספר התניא  –י''ט כסלו תש''פ",
            "הרב יורם אברג'ל - המסר היומי – כיפת ברזל –ט''ו טבת תש''פ",
            "הרב יורם אברג'ל - המסר היומי - איך לבחור שידוך מתאים? - ח' ניסן תשע\"ד",
            "הרב יורם אברג'ל - המסר היומי – תחשוב טוב יהיה טוב –ח' טבת תש''פ",
            "הרב יורם אברג'ל - המסר היומי – למה הבבא סאלי הסתיר פניו מן האורח?–ד' שבט תש''פ",
            "הרב יורם אברג'ל - המסר היומי – צא והלחם בעמלק –ט\"ז בשבט תש\"פ",
            "הרב יורם אברג'ל - המסר היומי – מים נגד מים –ב' חשוון תש''פ",
            "הרב יורם אברג'ל - המסר היומי –במעלות יהודה ויוסף –י''ב טבת תש''פ",
            "הרב יורם אברג'ל - המסר היומי – לא להתייאש –כ''ח אדר תש''פ",
            "הרב יורם אברג'ל - המסר היומי – ורחמיו על כל מעשיו –ח' חשוון תש''פ",
            "הרב יורם אברג'ל - המסר היומי - ברכת הרב להצלחת חיילי צה\"ל -כ' תמוז תשע\"ד",
            "הרב יורם אברג'ל - המסר היומי –להתחזק באמונה –כ''ג אדר תש''פ",
            "הרב יורם אברג'ל - המסר היומי - באבא סאלי מארח  - ג' שבט תשע\"ו",
            "הרב יורם אברג'ל -המסר היומי-  רק לעשות טוב- י''ד חשוון תש''פ",
            "הרב יורם אברג'ל - המסר היומי – בלי קושיות –ט' טבת תש\"פ",
            "הרב יורם אברג'ל - המסר היומי - איך נולד הבעל שם טוב? - י\"ב שבט תשע\"ו",
            "הרב יורם אברג'ל - המסר היומי –גילוי אליהו –ה' כסלו  תש''פ",
            "הרב יורם אברג'ל - המסר היומי - הזיווג הנכון- ט\"ו באב תשע\"ו",
            "הרב יורם אברג'ל - הדלקת נרות בבית הרב- כ\"ח כסלו תשע\"ה",
            "הרב יורם אברג'ל  - המסר היומי  - שבת הגדול -  ז' ניסן תש\"פ",
            "הרב יורם אברג'ל-אור זרוע לצדיק-כ\"ה אייר תשע\"ו",
            "הרב חיים יוסף אברג'ל-הסיפור היומי-לילו האחרון של הרב-כ\"ב טבת תשע\"ו",
            "הרב יורם אברג'ל - המסר היומי – אליאב בן חלון –כ''ז כסלו תש''פ",
            "הרב יורם אברג'ל - המסר היומי – ההכנה למצוה לא פחות מהמצוה –כ\"ו טבת תש\"פ",
            "הרב יורם אברג'ל - המסר היומי – רחל אימנו א'–ט' חשוון תש''פ",
            "הרב יורם אברג'ל-נשמת כל חי-א' טבת תשע\"ו",
            "הרב יורם אברג'ל - המסר היומי – תהילים ממתיקים הכל –י''ח טבת תש''פ",
            "הרב יורם אברג'ל - המסר היומי – תחוס על נשמתך –ג' כסלו תש''פ",
            "הרב יורם אברג'ל - המסר היומי – קוראו נא –כ''א אדר תש''פ",
            "הרב יורם אברג'ל - המסר היומי – אור לעיניים –כ''ד כסלו תש''פ",
            "הרב יורם אברג'ל - המסר היומי –מטל השמים ומשמני הארץ–ל' חשוון תש''פ",
            "הרב יורם אברג'ל - המסר היומי - בעמל תורה משיגים הכל - ט''ו בשבט תשע''ט",
            "הרב יורם אברג'ל - המסר היומי – עול תורה במקום עול דרך ארץ –כ''ה טבת תש''פ",
            "הרב יורם אברג'ל - המסר היומי – עצות לתיקון היסוד –כ\"ב טבת תש\"פ",
            "הרב יורם אברג'ל-סיפור החלאקה של ילד שחי בנס-כ\"ה אדר תשע\"ז",
            "הרב יורם אברג'ל - המסר היומי – כל הפושט יד נותנים לו –י''ד אדר תש''פ",
            "הרב יורם אברג'ל - המסר היומי - ברכות לראש צדיק -כ\"ז כסלו תשע\"ה",
            "הרב יורם אברג'ל - המסר היומי – כוחו של צדיק –י\"ט חשון תש\"פ",
            "הנעליים של הרב",
            "הרב יורם אברג'ל - המסר היומי – יש לי רב אחי –י''א כסלו תש''פ",
            "המסר היומי-הרב יורם אברג'ל-והסירותי מחלה מקרבך-ה' ניסן תש''פ",
            "הרב יורם אברג'ל - המסר היומי – ארבע אמות של גן עדן –כ\"ז חשון תש\"פ",
            "הרב יורם אברג'ל - המסר היומי - כשהבבא סאלי פגש את מר\"ן - כ\"ח תמוז תשע\"ה",
            "הרב יורם אברג'ל - המסר היומי - תמרור עצור - כ\"ח תשרי תשע\"ו",
            "הרב יורם אברג'ל - המסר היומי - המשיח עניו -ג' אב תשע\"ה",
            "הרב יורם אברג'ל - המסר היומי – בכל דבר שקורה יש רמז האלוקי –כ''ז אדר תש''פ",
            "הרב יורם אברג'ל - המסר היומי – ישראל מעל המזל–כ' אדר תש''פ",
            "הרב יורם אברג'ל - המסר היומי – הניקה בנים שרה –כ''ג חשוון תש''פ",
            "הרב יורם אברג'ל - המסר היומי – עטרת מרדכי –ט''ו אדר תש'פ",
            "הרב יורם אברג'ל - המסר היומי – רחל אימנו ב' –י''ב חשוון תש''פ",
            "הרב יורם אברג'ל -  המסר היומי-  לא נפרדים לעולם- כ''ה תשרי תש''פ",
            "הרב יורם אברג'ל - המסר היומי – שומר הברית – ה' חשון תש\"פ",
            "הרב יורם אברג'ל - המסר היומי – להתרחק מן העוון –י\"ח שבט תש\"פ",
            "הרב יורם אברג'ל-המסר היומי-אין תיקון גדול יותר מלימוד התורה- כ\"ח טבת תשע\"ז",
            "הרב יורם אברג'ל",
            "הרב יורם אברג'ל-המסר היומי-לעצור את מידת הדין מישראל-י''א ניסן תש''פ",
            "הרב יורם אברג'ל - המסר היומי - חג הגאולה שלנו - י''ט כסלו תשע''ט",
            "הרב יורם אברג'ל - המסר היומי - תפנה אליו - כ\"ה אדר ב' תשע\"ט",
            "הרב יורם אברג'ל - המסר היומי – שמור על זכות השתיקה –כ''ח תשרי תש''פ",
            "הרב יורם אברג'ל - המסר היומי - הילולת בעל התניא תשע\"ה",
            "הרב יורם אברג'ל-המסר היומי-יום הגאולה של החסידות- כ' כסלו תש\"פ",
            "אפוד היושרהרב יורם אברג'ל - המסר היומי – אפוד היושר –ו' אדר תש''פ",
            "הרב יורם אברג'ל - המסר היומי - בסוד החנוכה - כ\"ה כסלו תש\"פ",
            "הרב יורם אברג'ל - המסר היומי – בלי שיבוש –ט״ז באדר תש״פ",
            "הרב יורם אברג'ל-המסר היומי-חתונה לא בכל מחיר- כ\"ה סיון תשע\"ז",
            "הרב יורם אברג'ל-המסר היומי-אשת חיל עטרת בעלה- כ\"ג שבט תשע\"ז",
            "הרב יורם אברג'ל - המסר היומי – כעט ביד הסופר –כ''ב חשוון תש''פ",
            "הרב יורם אברג'ל - המסר היומי – תתעסק בשלך –ה' טבת תש''פ",
            "הרב יורם אברג'ל - המסר היומי - נותן לנו חיים - כ\"ו חשוון תשע\"ו",
            "הרב יורם אברג'ל - המסר היומי - קשר נצחי - כ\"ו תשרי תשע\"ו",
            "הרב יורם אברג'ל - ברית במערת המכפלה כ\"ג אדר ב' תשע\"ד",
            "הרב יורם אברג'ל - המסר היומי – נתנאל בן צוער –כ\"ו כסלו תש\"פ",
            "הרב יורם אברג'ל-המסר היומי-איש של בית- כ\"ג חשוון תשע\"ז",
            "הרב יורם אברג'ל - המסר היומי – כיצד מתקשרים לצדיק? –כ''ד תשרי תש''פ",
            "הרב יורם אברג'ל - המסר היומי – לא זזים מהתניא  –כ''ב כסלו תש''פ",
            "הרב יורם אברג'ל - המסר היומי - ארבעת המפתחות לפרנסה טובה -ה' באב תשע\"ה",
            "הרב יורם אברג'ל - המסר היומי - איך זוכים לפרנסה בשפע - יג' אדר א' תשע\"ד",
            "הרב יורם אברג'ל - המסר היומי – עצות לתיקון היסוד ג'–כ''ד טבת תש''פ"
        ];
    }

}
